Data/TestFiles/cases/Duct/case/system/topoSetZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    CylinderSelectedSurface;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/Cylinder.stl";
            useSurfaceOrientation true;
            outsidePoints   ();    //Ignored if useSurfaceOrientation true
            includeCut      false; //Ignored if useSurfaceOrientation true
            includeInside   true;
            includeOutside  false;
            nearDistance    -1;
            curvature       -100;
        }
    }

    {
        name    Cylinder;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set CylinderSelectedSurface;
        }
    }

);

// ************************************************************************* //
